{"title":"","author":"Pomax","content":"#Let's talk about Grandi.\n\nThere's a mathematical sequence that's been bothering me lately, and it's known as [Grandi's series](https://en.wikipedia.org/wiki/Grandi's_series), or simply as \"s\".\n\n`\\[s = 1-1 + 1 - 1 + 1 - 1 + 1 - 1 + ... \\]`\n\nor, as a sum,\n\n`\\[ \\sum_{n=0}^{\\infty}{-i^n} \\]`\n\nThe bit that's bothering is that as an infinite sequence, \"s\" should not have a well-defined value. The sum of the first term is 1, the first 2 terms is 0, the first three terms is 1 again, then 0, and so on. But infinities are weird, and so the argument goes that we can the following:\n\n`\\[s = 1-1 + 1 - 1 + 1 - 1 + 1 - 1 + ... \\]`\n`\\[1 - s = 1 - (1-1 + 1 - 1 + 1 - 1 + 1 - 1 + ... ) = 1 - 1 + 1 - 1 + 1 - 1 + ... = s\\]`\n\nFrom which it follows that if 1-s is s, then 1 = 2s, and thus the sum of this infinite series is actually the number 1/2. Mathemagical! Except for the part where that ...=s step is made, because it's not actually correct. Infinities are weird, and here's a neat little fact that should make you raise an eyebrow:\n\n`\\[1 - s = 1 - (a\\ sequence\\ of\\ length\\ S) =  (a\\ sequence\\ of\\ length\\ S) \\]`\n\nNow, both \"s\" and \"1-s\" are infinite series. But the \"sum\" 1-s is one term larger than the \"sum\" s:\n\n`\\[ 1 - \\sum_{n=0}^{\\infty}{-i^n} + \\sum_{n=0}^{\\infty}{-i^n} = 1 \\]`\n\nInfinities might be infinite, but they're still well defined, and even same-order infinities can have finite differences, so while the above \"s = 1/2\" is clever, it's also not true, but it's not true in a very devious way. Both s and 1-s are infinite sums, with infinite number of elements. But 1-s has 1 element more than s. We could say that a finite difference between two infinite sets is irrelevant in light of the infinities, but then we're also giving up the ability to use these infinities in mathematical formulae, so then we can't prove s is 1/2. Or, we can say that the rules of mathematics still need to apply and then we can demonstrate that the two infinite series differ by one element and we can't say s is 1/2. \n\nEither way, I find myself unable to accept s is one half. And that's the most remarkable part of this excursion.","tags":["Maths","Riemann","Grandi"],"published":1397594311833,"updated":1397600164910}