{"title":"","author":"Pomax","content":"#Keeping things https\n\nI hate mixed content. Properly. If there was a button I could pressed that forced browsers to reset to a \"pre mixed-content\" world, I'd press it twice.\n\nFirst of all, I understand what SSL connections offer in terms of security, and what they don't.  What they do, is offer in-transit protection of data. If I request resource X from server Y, then that's usually over a good ten or more \"hops\". On a non-secured connection, anyone who happens to see the data fly by can modify it that data and then send on the modified data. That's potentially bad (someone could change that JS library you're using to snoop for session information and send it to a aggregation service, for instance). Using a secured connection, that's impossible to do (sort of) because the data being sent back and forth is encrypted. In order to modify that JS library, a third party now needs to first decode the response from the server, modify it, and then reencode it with the same set of \"keys\". Impossible, right?\n\nWell, no. If that third party was listening the entire time, they have the entire agreement your browser made with the remote server, including the keys you exchanged, and the encryption protocol you agreed on.  And in a simple act, https has been defeated. The idea that a \"man in the middle\" is only going to be looking for packets being sent for \"something that can be modified for great evil\" is nonsense. If the machine in between you and the server you talk to is compromised, you can bank on the fact that they are looking at all the packets, and work with full sessions. Why? Because that's where you make crime money. And if it makes money, that's what you do.\n\nUnfortunately, browsers are made for people who know nothing about any of this, and just want to be told their connection is \"secure\", even when it very much isn't. And that brings us to today, where browsers will spazz out when they're loading a webpage over https:// and that page tries to load resources (css files, javascript libraries, even images) that are hosted on http:// instead. Thanks to collective ignorance (or rather, thanks to selective knowledge) browsers panic and will show all kinds of warning signs. Like on this blog.\n\nI'm linking to an image that is hosted on one of my other sites. That site is on http, and this blog is on https, and this is the end of the secure world as far as your browser is concerned. So, I'm going to have to find a way to add images to my blog in a way that is secure.\n\nAnd that's all a really elaborate lead-up to staying in the spirit of this github blog: I'll be adding an implementation of the HTML drag and drop concept so that I can drag images into this blog, and have the underlying JS code automatically accept that binary data, package it as a git commit, and then have that commit pushed to github, so that the image ends up in the pomax.github.io repository, thus making it available as a relative link. Handy? yes. Secure? I think we've established \"no\". Something I don't even have to think about to make work? That's the only reason I wrote this blogging software ;)\n\nSo now I just need to find a nice way to implement the same things that [this fiddle](http://jsfiddle.net/JtJ5N/1) does, in a way that's wrapped by a github commit push. Fun times ahead!","tags":["Blog","Github","https","Mixed Content"],"published":1395360750136,"updated":1395361599435}